OpenFOAM-pulsingJet_cases/pitz/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.01;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.001;       // 0.1% turbulent intensity
        value           $internalField;
    }
	
	outlet
    {
        type            zeroGradient; 
    }
	
	walls
    {
        type            kqRWallFunction;
        value           uniform $kInlet;
    }

	frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
